# Task-1: Data Quality Issues _ NewCustomerList

The client has provided us with four datasets.
They are:
1) Customer Demographic
2) Transaction details
3) Customer address
4) New customer list

In [1]:
#Import the required librariesabs
import pandas as pd

## Reading one of the sheets in an Excel file saperately

In [2]:
df=pd.read_excel('G:\My Drive\KPMG\Task 1\KPMG_ImportPython.xlsx',"NewCustomerList")
df.head(5)

,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,owns_car,...,state,country,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
0,Chickie,Brister,Male,86,1957-07-12,General Manager,Manufacturing,Mass Customer,N,Yes,...,QLD,Australia,6,1.01,1.2625,1.578125,1.341406,1,1,1.718750
1,Morly,Genery,Male,69,1970-03-22,Structural Engineer,Property,Mass Customer,N,No,...,NSW,Australia,11,0.57,0.5700,0.712500,0.605625,1,1,1.718750
2,Ardelis,Forrester,Female,10,1974-08-28,Senior Cost Accountant,Financial Services,Affluent Customer,N,No,...,VIC,Australia,5,1.07,1.0700,1.070000,1.070000,1,1,1.718750
3,Lucine,Stutt,Female,64,1979-01-28,Account Representative III,Manufacturing,Affluent Customer,N,Yes,...,QLD,Australia,1,0.71,0.8875,0.887500,0.887500,4,4,1.703125
4,Melinda,Hadlee,Female,34,1965-09-21,Financial Analyst,Financial Services,Affluent Customer,N,No,...,NSW,Australia,9,0.53,0.5300,0.662500,0.662500,4,4,1.703125

Let us copy the same data frame (as below) so that changes to be made in future may not affect the Excel file

In [3]:
df=df.copy()

## Checking data types of each columns

In [4]:
df.dtypes

first_name                                     object
last_name                                      object
gender                                         object
past_3_years_bike_related_purchases             int64
DOB                                    datetime64[ns]
job_title                                      object
job_industry_category                          object
wealth_segment                                 object
deceased_indicator                             object
owns_car                                       object
tenure                                          int64
address                                        object
postcode                                        int64
state                                          object
country                                        object
property_valuation                              int64
Unnamed: 16                                   float64
Unnamed: 17                                   float64
Unnamed: 18                                   float64
Unnamed: 19                                   float64
Unnamed: 20                                     int64
Rank                                            int64
Value                                         float64
dtype: object

We can observe that some unwanted columns like 'Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18', 'Unnamed: 19', 'Unnamed: 20' are there. Lets us remove the same.

Let us copy the column name by explorinng columns

In [5]:
df.columns

Index(['first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'owns_car', 'tenure', 'address', 'postcode', 'state', 'country',
       'property_valuation', 'Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18',
       'Unnamed: 19', 'Unnamed: 20', 'Rank', 'Value'],
      dtype='object')

The columns have been copied and will be gathered as "removeColumns"

In [6]:
removeColumns=['Unnamed: 16', 'Unnamed: 17', 'Unnamed: 18',
       'Unnamed: 19', 'Unnamed: 20']

Now, remove unwanted gathered columns from the data frame

In [7]:
df.drop(columns=removeColumns, inplace=True)
df.columns

Index(['first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'owns_car', 'tenure', 'address', 'postcode', 'state', 'country',
       'property_valuation', 'Rank', 'Value'],
      dtype='object')

The unwanted columns are successfully removed.

## Exploring shape of the sheet

In [8]:
df.shape

(1000, 18)

## Describe the data columnwise use "df.describe()"

## Checking for Null/missing values

In [9]:
df.isnull().sum()

first_name                               0
last_name                               29
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     17
job_title                              106
job_industry_category                  165
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
address                                  0
postcode                                 0
state                                    0
country                                  0
property_valuation                       0
Rank                                     0
Value                                    0
dtype: int64

## Exploring columns

In [10]:
df.iloc[:,7].value_counts()

Mass Customer        508
High Net Worth       251
Affluent Customer    241
Name: wealth_segment, dtype: int64

Here, in square brackets [  ], : before comma indicates the row index, here : means all rows. Similarly values after comma indicates the column index, here 7 means 8th column Because, the indices in python start with zero.

Below is the other way to explore the same column, i.e. Transactions.iloc[:,7] = wealth_segment

In [11]:
df['wealth_segment'].value_counts()

Mass Customer        508
High Net Worth       251
Affluent Customer    241
Name: wealth_segment, dtype: int64

## Why to see value_counts seperately for each column?, Make a loop so that together we get the desired answer for all columns..

In [12]:
df.columns

Index(['first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'owns_car', 'tenure', 'address', 'postcode', 'state', 'country',
       'property_valuation', 'Rank', 'Value'],
      dtype='object')

In [13]:
df_columns=['first_name', 'last_name', 'gender',
       'past_3_years_bike_related_purchases', 'DOB', 'job_title',
       'job_industry_category', 'wealth_segment', 'deceased_indicator',
       'owns_car', 'tenure', 'address', 'postcode', 'state', 'country',
       'property_valuation', 'Rank', 'Value']

In [14]:
for i in df_columns:
    print(df[i].value_counts())

Rozamond     3
Mandie       3
Dorian       3
Tyne         2
Cami         2
Wyn          2
Cristen      2
Claudine     2
Bartram      2
Feodor       2
Arty         2
Nicol        2
Laurie       2
Liane        2
Art          2
Jesse        2
Suzy         2
Esther       2
Otis         2
Beverlee     2
Harman       2
Sada         2
Marcelia     2
Inglebert    2
Morganica    2
Aloysius     2
Wheeler      2
Cissiee      2
Anthony      2
Barth        2
            ..
Stephani     1
Leonid       1
Daisi        1
Ange         1
Fredia       1
Kenneth      1
Ivy          1
Farra        1
Sindee       1
Celia        1
Sheena       1
Leese        1
Leona        1
Lyndell      1
Mandi        1
Bessie       1
Zechariah    1
Donica       1
Jethro       1
Andee        1
Edin         1
Malvin       1
Bink         1
Bastien      1
Levy         1
Briant       1
Paulina      1
Jordan       1
Norina       1
Vyky         1
Name: first_name, Length: 940, dtype: int64
Crellim          2
Minshall         2
Sissel           2
Van den Velde    2
Sturch           2
Borsi            2
Hallt            2
Burgoine         2
Shoesmith        2
Eade             2
Loalday          1
Woodhams         1
Drance           1
Winchcum         1
Laundon          1
Crinidge         1
Copins           1
Mandy            1
Blackader        1
Olechnowicz      1
Preddy           1
Temby            1
Moriarty         1
Gorini           1
Cleare           1
Kleinplatz       1
Wohler           1
Summerly         1
D'Agostini       1
Filisov          1
                ..
Matten           1
Mabley           1
Leete            1
Bertot           1
Natt             1
Thredder         1
Strafford        1
Ungerechts       1
Rantoull         1
Andrieux         1
Fanstone         1
Groucock         1
Worsfold         1
Lovett           1
Poolton          1
Birney           1
Ortells          1
Bannister        1
Rouchy           1
O'Shirine        1
Patshull         1
Simmig           1
Woodroof         1
Wellbelove       1
Carlone          1
Whellams         1
Genery           1
Paschke          1
Keunemann        1
Newport          1
Name: last_name, Length: 961, dtype: int64
Female    513
Male      470
U          17
Name: gender, dtype: int64
60    20
59    18
70    17
42    17
37    16
11    16
47    15
84    14
62    14
57    14
67    14
79    14
30    13
15    13
71    13
64    13
7     13
44    13
5     13
46    12
83    12
82    12
25    12
50    12
94    12
56    12
66    12
61    11
22    11
74    11
      ..
96     9
95     8
14     8
43     8
33     8
24     8
63     8
34     8
91     8
1      8
53     8
8      7
89     7
40     7
41     7
28     7
31     7
35     7
80     6
16     6
10     6
90     6
76     6
98     6
77     6
19     5
9      5
92     5
85     4
20     3
Name: past_3_years_bike_related_purchases, Length: 100, dtype: int64
1961-07-31    2
1994-04-15    2
1987-01-15    2
1951-11-28    2
1979-07-28    2
1951-04-30    2
1959-08-01    2
1965-07-03    2
1955-11-25    2
1997-10-23    2
1978-12-14    2
1992-10-13    2
1995-08-13    2
1963-08-25    2
1993-11-02    2
1977-11-08    2
1971-04-26    2
1951-04-29    2
1966-01-02    2
1978-01-15    2
1945-06-11    2
1941-07-21    2
1959-09-18    2
1998-02-05    2
1974-12-25    2
1967-02-03    1
1974-01-24    1
1939-02-19    1
1973-10-03    1
1963-10-16    1
             ..
1979-01-09    1
1969-07-20    1
1954-03-08    1
1957-10-17    1
2002-01-04    1
1977-09-11    1
1986-01-10    1
1951-02-05    1
1943-02-08    1
1982-12-10    1
1942-08-23    1
1955-07-17    1
1995-05-18    1
1976-10-08    1
1975-08-04    1
1978-04-02    1
1980-03-14    1
1997-03-13    1
1996-01-21    1
1986-12-03    1
1994-02-10    1
1976-08-24    1
1966-09-17    1
1960-08-31    1
1951-10-14    1
1947-04-21    1
1995-10-10    1
1964-08-23    1
1962-05-12    1
1958-04-21    1
Name: DOB, Length: 958, dtype: int64
Associate Professor                     15
Software Consultant                     14
Environmental Tech                      14
Chief Design Engineer                   13
Senior Sales Associate                  12
Assistant Manager                       12
Assistant Media Planner                 12
Cost Accountant                         12
VP Sales                                12
Nurse Practicioner                      11
Payment Adjustment Coordinator          11
Social Worker                           11
VP Marketing                            11
Account Executive                       11
VP Quality Control                      11
Environmental Specialist                11
Junior Executive                        11
Chemical Engineer                       10
Librarian                               10
Human Resources Manager                 10
Business Systems Development Analyst    10
Financial Analyst                       10
Product Engineer                        10
Structural Engineer                     10
Dental Hygienist                        10
Nurse                                    9
Senior Cost Accountant                   9
VP Product Management                    9
Clinical Specialist                      9
Civil Engineer                           9
                                        ..
Account Representative II                1
Research Assistant I                     1
Statistician IV                          1
Software Test Engineer II                1
Web Developer I                          1
Accountant I                             1
Systems Administrator III                1
Computer Systems Analyst IV              1
Programmer Analyst IV                    1
Developer II                             1
Computer Systems Analyst II              1
Health Coach I                           1
Accounting Assistant II                  1
Systems Administrator I                  1
Safety Technician IV                     1
Administrative Officer                   1
Media Manager I                          1
Accountant II                            1
Systems Administrator IV                 1
Staff Accountant I                       1
Computer Systems Analyst III             1
Human Resources Assistant I              1
Statistician III                         1
Automation Specialist IV                 1
Engineer II                              1
Database Administrator I                 1
Safety Technician II                     1
Staff Accountant II                      1
Web Developer II                         1
Developer III                            1
Name: job_title, Length: 184, dtype: int64
Financial Services    203
Manufacturing         199
Health                152
Retail                 78
Property               64
IT                     51
Entertainment          37
Argiculture            26
Telecommunications     25
Name: job_industry_category, dtype: int64
Mass Customer        508
High Net Worth       251
Affluent Customer    241
Name: wealth_segment, dtype: int64
N    1000
Name: deceased_indicator, dtype: int64
No     507
Yes    493
Name: owns_car, dtype: int64
9     79
13    74
11    68
10    63
12    61
7     60
5     60
17    59
15    58
8     55
14    54
16    49
6     45
18    36
4     36
19    34
3     26
21    24
20    22
2     15
22    12
1      8
0      2
Name: tenure, dtype: int64
276 Derek Circle             1
5512 Ronald Regan Hill       1
77608 Donald Center          1
76733 Sunbrook Terrace       1
43094 Kedzie Pass            1
3867 Barby Hill              1
55 Dorton Point              1
8427 Moulton Place           1
71 Ludington Center          1
25805 Eagan Place            1
817 Loftsgordon Road         1
1861 Chive Court             1
564 Forest Dale Avenue       1
1550 Russell Way             1
32 Hazelcrest Court          1
6 Killdeer Way               1
28970 Monument Lane          1
0 Larry Park                 1
797 Westend Street           1
8 Fordem Place               1
590 Hagan Parkway            1
5 Briar Crest Road           1
9 Spohn Way                  1
29307 Russell Avenue         1
12 Eastlawn Terrace          1
34 Jay Hill                  1
59252 Maryland Drive         1
28 Parkside Park             1
0 Meadow Ridge Street        1
2886 Buena Vista Terrace     1
                            ..
598 Memorial Place           1
7 Clemons Circle             1
62 Melrose Court             1
5 Myrtle Junction            1
207 Annamark Plaza           1
18 Morning Circle            1
2030 Anderson Lane           1
936 Porter Lane              1
345 Fieldstone Park          1
05123 Bobwhite Plaza         1
0736 West Crossing           1
4882 Dakota Center           1
6936 Homewood Avenue         1
79 Armistice Parkway         1
91 Calypso Trail             1
64 Armistice Point           1
555 Hermina Avenue           1
10236 Mifflin Avenue         1
56766 Mariners Cove Place    1
92214 Spenser Road           1
8 Grayhawk Circle            1
07 Susan Lane                1
2116 Continental Terrace     1
8970 Anhalt Junction         1
1607 Westridge Drive         1
95306 John Wall Avenue       1
14709 Portage Avenue         1
8288 Lyons Way               1
2 Jackson Place              1
4 Valley Edge Plaza          1
Name: address, Length: 1000, dtype: int64
2232    9
2145    9
2168    7
2750    7
3029    7
4207    7
2148    7
3977    7
2066    6
4350    6
3030    6
2121    6
3163    6
2026    6
2770    6
2170    6
2560    6
2250    5
4500    5
2323    5
2114    5
2230    5
3810    5
4165    5
4556    5
2763    5
2155    5
2209    5
4000    5
2161    4
       ..
3031    1
2400    1
4221    1
4133    1
3754    1
3753    1
3437    1
2258    1
3444    1
2422    1
2118    1
4300    1
3340    1
4161    1
4370    1
3777    1
2324    1
3079    1
2330    1
2749    1
2340    1
2344    1
4405    1
2358    1
3250    1
4408    1
2151    1
4159    1
3121    1
3051    1
Name: postcode, Length: 522, dtype: int64
NSW    506
VIC    266
QLD    228
Name: state, dtype: int64
Australia    1000
Name: country, dtype: int64
9     173
8     162
7     138
10    116
6      70
11     62
5      57
4      53
3      51
12     46
2      42
1      30
Name: property_valuation, dtype: int64
760     13
259     12
455      9
904      9
386      9
133      9
700      8
820      8
312      8
536      8
708      7
913      7
104      7
810      7
89       7
252      7
166      7
181      7
691      7
575      7
420      7
832      6
444      6
195      6
871      6
845      6
146      6
486      6
206      6
930      6
        ..
574      1
582      1
594      1
747      1
371      1
370      1
230      1
157      1
920      1
903      1
898      1
173      1
882      1
190      1
201      1
870      1
218      1
842      1
750      1
240      1
248      1
249      1
284      1
794      1
793      1
785      1
773      1
754      1
355      1
1000     1
Name: Rank, Length: 324, dtype: int64
0.637500    13
1.062500    12
1.237500     9
0.892500     9
0.945625     9
0.500000     9
0.825000     8
1.020000     8
0.687500     8
0.584375     8
1.073125     7
1.287500     7
0.499375     7
0.796875     7
1.158125     7
1.312500     7
0.587500     7
0.913750     7
0.680000     7
0.690625     7
1.175000     7
0.662500     6
1.275000     6
1.225000     6
0.669375     6
1.025000     6
1.137500     6
0.575000     6
0.541875     6
1.147500     6
            ..
0.810000     1
1.341406     1
0.391000     1
0.916406     1
1.195312     1
0.544000     1
0.799000     1
1.314844     1
0.733125     1
0.940000     1
1.090000     1
1.075781     1
1.155469     1
0.924375     1
0.830000     1
0.400000     1
0.929688     1
0.910000     1
0.714000     1
0.654500     1
0.810156     1
0.781250     1
0.620000     1
0.773500     1
0.650000     1
0.630000     1
0.340000     1
0.875500     1
0.867000     1
1.142187     1
Name: Value, Length: 324, dtype: int64

## Determining percetage of  missing values in each column.

In [15]:
missing_count=df.isnull().sum()
missing_count

first_name                               0
last_name                               29
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     17
job_title                              106
job_industry_category                  165
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
address                                  0
postcode                                 0
state                                    0
country                                  0
property_valuation                       0
Rank                                     0
Value                                    0
dtype: int64

In [16]:
total=len(df)
total

1000

In [17]:
percentageMissing=missing_count*100/total
percentageMissing

first_name                              0.0
last_name                               2.9
gender                                  0.0
past_3_years_bike_related_purchases     0.0
DOB                                     1.7
job_title                              10.6
job_industry_category                  16.5
wealth_segment                          0.0
deceased_indicator                      0.0
owns_car                                0.0
tenure                                  0.0
address                                 0.0
postcode                                0.0
state                                   0.0
country                                 0.0
property_valuation                      0.0
Rank                                    0.0
Value                                   0.0
dtype: float64

In [18]:
missing_data=pd. DataFrame({'Heading': df.columns, 'total_missing': missing_count,'Percentage_missing': percentageMissing})
missing_data.sort_values('total_missing', ascending=False)
missing_data=missing_data.loc[missing_data['total_missing'] > 0]
missing_data

,Heading,total_missing,Percentage_missing
last_name,last_name,29,2.9
DOB,DOB,17,1.7
job_title,job_title,106,10.6
job_industry_category,job_industry_category,165,16.5

In [19]:
missing_data.to_csv('missing_data_NewCustList.csv', index=False)

## Deteriming if duplicate value is there in the data frame

In [20]:
duplicate=df[df.duplicated()]
duplicate

Empty DataFrame
Columns: [first_name, last_name, gender, past_3_years_bike_related_purchases, DOB, job_title, job_industry_category, wealth_segment, deceased_indicator, owns_car, tenure, address, postcode, state, country, property_valuation, Rank, Value]
Index: []

In [21]:
len(duplicate)

0

## Viewing categorical data

In [22]:
df['gender'].value_counts()

Female    513
Male      470
U          17
Name: gender, dtype: int64

In [23]:
df['job_title'].value_counts()

Associate Professor                     15
Software Consultant                     14
Environmental Tech                      14
Chief Design Engineer                   13
Senior Sales Associate                  12
Assistant Manager                       12
Assistant Media Planner                 12
Cost Accountant                         12
VP Sales                                12
Nurse Practicioner                      11
Payment Adjustment Coordinator          11
Social Worker                           11
VP Marketing                            11
Account Executive                       11
VP Quality Control                      11
Environmental Specialist                11
Junior Executive                        11
Chemical Engineer                       10
Librarian                               10
Human Resources Manager                 10
Business Systems Development Analyst    10
Financial Analyst                       10
Product Engineer                        10
Structural Engineer                     10
Dental Hygienist                        10
Nurse                                    9
Senior Cost Accountant                   9
VP Product Management                    9
Clinical Specialist                      9
Civil Engineer                           9
                                        ..
Account Representative II                1
Research Assistant I                     1
Statistician IV                          1
Software Test Engineer II                1
Web Developer I                          1
Accountant I                             1
Systems Administrator III                1
Computer Systems Analyst IV              1
Programmer Analyst IV                    1
Developer II                             1
Computer Systems Analyst II              1
Health Coach I                           1
Accounting Assistant II                  1
Systems Administrator I                  1
Safety Technician IV                     1
Administrative Officer                   1
Media Manager I                          1
Accountant II                            1
Systems Administrator IV                 1
Staff Accountant I                       1
Computer Systems Analyst III             1
Human Resources Assistant I              1
Statistician III                         1
Automation Specialist IV                 1
Engineer II                              1
Database Administrator I                 1
Safety Technician II                     1
Staff Accountant II                      1
Web Developer II                         1
Developer III                            1
Name: job_title, Length: 184, dtype: int64

In [24]:
df['job_industry_category'].value_counts()

Financial Services    203
Manufacturing         199
Health                152
Retail                 78
Property               64
IT                     51
Entertainment          37
Argiculture            26
Telecommunications     25
Name: job_industry_category, dtype: int64

In [25]:
df['wealth_segment'].value_counts()

Mass Customer        508
High Net Worth       251
Affluent Customer    241
Name: wealth_segment, dtype: int64

In [26]:
df['deceased_indicator'].value_counts()

N    1000
Name: deceased_indicator, dtype: int64

In [27]:
df['owns_car'].value_counts()

No     507
Yes    493
Name: owns_car, dtype: int64

In [28]:
df['state'].value_counts()

NSW    506
VIC    266
QLD    228
Name: state, dtype: int64

In [29]:
df['country'].value_counts()

Australia    1000
Name: country, dtype: int64

## Adding Age (Calculated from DOB) into data frame

In [30]:
now = pd.Timestamp('now')

In [31]:
df['DOB']=pd.to_datetime(df['DOB'], format='%m%d%y')
df['DOB'].head()

0   1957-07-12
1   1970-03-22
2   1974-08-28
3   1979-01-28
4   1965-09-21
Name: DOB, dtype: datetime64[ns]

In [32]:
import numpy as np
df['DOB']=df['DOB'].where(df['DOB']<now,df['DOB']-np.timedelta64(100,'Y'))
df['age']=(now-df['DOB']).astype('<m8[Y]')
df['age'].head()

0    65.0
1    52.0
2    48.0
3    43.0
4    57.0
Name: age, dtype: float64

## Replacing value in columns

In [33]:
df=df.replace({'gender':{'Female':'F', 'Male':'M'}})
df['gender'].head()

0    M
1    M
2    F
3    F
4    F
Name: gender, dtype: object

In [34]:
df['gender'].value_counts()

F    513
M    470
U     17
Name: gender, dtype: int64

## Save the data frame in '.csv' fromat

In [35]:
df.to_csv('NewCustList_Done.csv', index=False)